# Сейчас на часах 9 часов 45 минут утра. Напишите программу, которая считает
# количество секунд, прошедшее с полуночи.


# Дан прямоугольный треугольник с катетами 4 и 5 метра. Напишите программу,
# которая считает длину гипотенузы. Результат округлите до сотых.


# Есть логическая переменная  weekday. Напишите программу, которая выводит сообщение
# “рабочий день”, если переменная истинна и сообщение  “выходной” - если ложна.


# У нас есть две обезьяны a и b. Они могут улыбаться или не улыбаться (True / False).
# Если они одновременно улыбаются или не улыбаются, то у нас проблемы.
# Написать программу, которaе печатает есть ли у нас проблемы в зависимости
# от улыбчивости обезьян.


# Для заданного натурального числа N подсчитать количество четных натуральных
# чисел, меньше или равных N.


# Определите среднее значение всех элементов последовательности, завершающейся
# числом 0. Среднее значение - сумма всех элементов, поделенная на их количество.
# Программа запрашивает ввести первое число, потом второе и т.д. до тех пор пока
# не будет введён ноль. Как только вводится ноль программа перестаёт запрашивать
# числа и выводит среднее значение всех введённых до нуля чисел.


# Вводится вещественное число и нам нужно его округлить до 2 и 3 разряда
# после запятой и вывести полученный результат через пробел в одной строчке.
# Воспользуемся функцией round — встроенная функция Python. Программа должна
# верно округлять как положительные, так и отрицательные числа.
