# Напишите функцию, которая принимает список кортежей от пользователя, где
# каждый кортеж содержит информацию о студенте (имя, возраст, средний балл).
# Программа должна вывести на экран имена студентов, чей средний балл выше
# заданного значения. Используйте методы кортежей и циклы для обработки данных.
# Выведите итоговый список на экран с помощью команды print.
#
# Пример списка кортежей:
# [("Alice", 20, 90), ("Bob", 19, 80), ("Charlie", 21, 95), ("David", 18, 85)]
#
# ("Alice", 20, 90); ("Bob", 19, 80); ("Charlie", 21, 95); ("David", 18, 85)
# list = ['("Alice", 20, 90)', '("Bob", 19, 80)', '("Charlie", 21, 95)', '("David", 18, 85)']
#
# '"Alice", 20, 90' -> list = ['"Alice"', '20', '90']  -> ('Alice', 20, 90)
#
# Пример вывода:
# Введите пороговое значение среднего балла: 90
# Студенты с средним баллом выше 90 : ['Charlie']

def str2tuplelist(s):
    s = s.replace("),", ");")
    s = s.replace("[", "")
    s = s.replace("]", "")
    s = s.split("; ")
    for i in range(len(s)):
        s[i] = s[i].replace("(", "")
        s[i] = s[i].replace(")", "")
        a, b, c = s[i].split(", ")
        s[i] = (a.strip('"'), int(b), int(c))
    return s


d = []
a = str2tuplelist(input("Введите список кортежей: "))
m = int(input("Введите пороговое значение: "))

for i in a:
    if i[2] > m:
        d.append(i[0])

print(d)
