# Написать на Python программу, которая узнает погоду в заданном городе.
# В интернете большое количество сервисов, которые “отдают” погоду через т.н.
# REST API. Работаем с сервисом Weather API. (Этот сервис бесплатный, но нужна
# регистрация и есть ограничение на количество запросов от одного пользователя
# в день). Скопируйте этот API Key и сохраните, он пригодится позже.
# интерактивный эксплорер: https://www.weatherapi.com/api-explorer.aspx
#
# Прежде, чем писать программу, нужно зарегистрироваться на сайте и найти в своем
# аккаунте свой API Key, который нужно отправлять с каждым запросом на сервер.
# API Key: 04430e1f9a4749bc9fd170739241304
