# Создать класс Person и несколько объектов данного класса. При создании
# объектов данного класса должны прокидываться обязательные атрибуты: рост,
# вес, год рождения и пол. Пол может быть только либо мужской либо женский.
# Дополнить класс Person операцией сложения. При сложении двух объектов этого
# класса (обязательно разнополых) операция должна возвращать новый объект
# класса Person, у которого рост - четверть от среднего арифметического роста
# родителей, вес - двадцатая часть от среднего арифметического веса родителей,
# год рождения - текущий, значение пола случайное или мужчина или женщина.
# Дополнительно придумать и определить методы _len_, _bool_.
